tap "aws/tap"
tap "pomerium/tap"
brew "act"
brew "aws-vault"
brew "awscli"
brew "azure-cli"
brew "direnv"
brew "docker-credential-helper"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "helm"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kind"
brew "kubecolor"
brew "kubectx"
brew "kubernetes-cli"
brew "lolcat"
brew "node@22"
brew "pgcli"
brew "postgresql@16"
brew "pyenv"
brew "shellcheck"
brew "starship"
brew "tcl-tk"
brew "tfenv"
brew "tgenv"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "aws/tap/eksctl"
brew "pomerium/tap/pomerium-cli"
cask "cursor"
cask "font-ubuntu-mono-nerd-font"
cask "hiddenbar"
cask "jordanbaird-ice"
cask "notunes"
cask "rectangle"
cask "session-manager-plugin"
cask "zed"
